mcu-coder/stm32_greenhouse-environment/1.源代码/HARDWARE/MODULES/Modules.h
#ifndef	__MODULES_H_
#define __MODULES_H_

#include "stm32f10x.h"                  // Device header
#include "dht11.h"
#include "LDR.h"
#include "ts.h"
typedef struct
{
	uint8_t humi;
	uint8_t temp;
	uint16_t lux;	
	uint16_t soilHumi;
	uint16_t Smoge;	
	uint16_t AQI;
	uint16_t CO;
	uint16_t hPa;
	uint16_t ts;
	uint16_t rain;
	uint16_t pm25;
}SensorModules;

typedef struct
{
	uint8_t humiValue;
	uint8_t tempValue;
	uint16_t soilHumiValue;
	uint16_t lux_Max;
	uint16_t lux_Min;
	
}SensorThresholdValue;

typedef struct
{
	uint8_t LED_Flag;
	uint8_t NOW_Curtain_Flag;
	uint8_t Curtain_Flag;	
	uint8_t NOW_StepMotor_Flag;
	uint8_t StepMotor_Flag;	
	uint8_t Fan_Flag;
	uint8_t Humidifier_Flag;
	uint8_t Bump_Flag;
	uint8_t Jdq_Flag;
	uint8_t Beep_Flag;
	uint8_t Mode_Flag;
	
	
}DriveModules;
 	

extern SensorModules sensorData;			//声明传感器模块的结构体变量
extern SensorThresholdValue Sensorthreshold;	//声明传感器阈值结构体变量
extern DriveModules driveData;				//声明驱动器状态的结构体变量
void SensorScan(void);

#endif
